Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.vault.helm_release.vault will be updated in-place
~ resource "helm_release" "vault" {
        id                         = "vault"
      ~ metadata                   = [
          - {
              - app_version    = "1.17.2"
              - chart          = "vault"
              - first_deployed = 1738077315
              - last_deployed  = 1738077315
              - name           = "vault"
              - namespace      = "vault"
              - notes          = <<-EOT
                    Thank you for installing HashiCorp Vault!
                    
                    Now that you have deployed Vault, you should look over the docs on using
                    Vault with Kubernetes available here:
                    
                    https://developer.hashicorp.com/vault/docs
                    
                    
                    Your release is named vault. To learn more about the release, try:
                    
                      $ helm status vault
                      $ helm get manifest vault
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - global = {
                          - enabled    = true
                          - tlsDisable = true
                        }
                      - server = {
                          - auditStorage   = {
                              - enabled = true
                            }
                          - dataStorage    = {
                              - enabled = true
                            }
                          - ha             = {
                              - enabled  = true
                              - raft     = {
                                  - config    = <<-EOT
                                        ui = true
                                        cluster_name = "vault-integrated-storage"
                                        listener "tcp" {
                                          address = "[::]:8200"
                                          cluster_address = "[::]:8201"
                                          tls_disable = "true"
                                        }
                                        
                                        storage "raft" {
                                          path = "/vault/data"
                                          retry_join {
                                            leader_api_addr = "http://vault-0.vault-internal:8200"
                                          }
                                          retry_join {
                                            leader_api_addr = "http://vault-1.vault-internal:8200"
                                          }
                                          retry_join {
                                            leader_api_addr = "http://vault-2.vault-internal:8200"
                                          }
                                          autopilot {
                                            server_stabilization_time = "10s"
                                            last_contact_threshold = "10s"
                                            min_quorum = 3
                                            cleanup_dead_servers = false
                                            dead_server_last_contact_threshold = "10m"
                                            max_trailing_logs = 1000
                                            disable_upgrade_migration = false
                                          }
                                        }
                                    EOT
                                  - enabled   = true
                                  - setNodeId = true
                                }
                              - replicas = 3
                            }
                          - livenessProbe  = {
                              - enabled             = true
                              - initialDelaySeconds = 60
                              - path                = "/v1/sys/health?standbyok=true"
                            }
                          - readinessProbe = {
                              - enabled = true
                              - path    = "/v1/sys/health?standbyok=true&sealedcode=204&uninitcode=204"
                            }
                          - standalone     = {
                              - enabled = false
                            }
                        }
                      - ui     = {
                          - enabled         = true
                          - externalPort    = 8200
                          - serviceNodePort = null
                          - serviceType     = "LoadBalancer"
                        }
                    }
                )
              - version        = "0.28.1"
            },
        ] -> (known after apply)
        name                       = "vault"
      ~ values                     = [
          ~ <<-EOT
                global:
                  enabled: true
                  tlsDisable: true
                
                server:
                  # Stateful storage
                  dataStorage:
                    enabled: true
                  auditStorage:
                    enabled: true
                
                  # For HA configuration and because we need to manually init the vault,
                  # we need to define custom readiness/liveness Probe settings
                  readinessProbe:
                    enabled: true
                    path: "/v1/sys/health?standbyok=true&sealedcode=204&uninitcode=204"
                  livenessProbe:
                    enabled: true
                    path: "/v1/sys/health?standbyok=true"
                    initialDelaySeconds: 60
                
                  # This configures the Vault Statefulset to create a PVC for audit logs.
                  # See https://www.vaultproject.io/docs/audit/index.html to know more
                  auditStorage:
                    enabled: true
                  standalone:
                    enabled: false
                
                  # Run Vault in "HA" mode.
                  ha:
                    enabled: true
                    replicas: 3
                    raft:
                      enabled: true
                      setNodeId: true
                
                      config: |
                        ui = true
                        cluster_name = "vault-integrated-storage"
                        listener "tcp" {
                          address = "[::]:8200"
                          cluster_address = "[::]:8201"
                          tls_disable = "true"
                        }
                
                        storage "raft" {
                          path = "/vault/data"
                          retry_join {
                            leader_api_addr = "http://vault-0.vault-internal:8200"
                          }
                          retry_join {
                            leader_api_addr = "http://vault-1.vault-internal:8200"
                          }
                          retry_join {
                            leader_api_addr = "http://vault-2.vault-internal:8200"
                          }
                          autopilot {
                            server_stabilization_time = "10s"
                            last_contact_threshold = "10s"
                            min_quorum = 3
                            cleanup_dead_servers = false
                            dead_server_last_contact_threshold = "10m"
                            max_trailing_logs = 1000
                            disable_upgrade_migration = false
                          }
                        }
                
                # Vault UI
                ui:
                  enabled: true
              -   serviceType: "LoadBalancer"
              +   serviceType: "ClusterIP"
                  serviceNodePort: null
              -   externalPort: 8200
              +   externalPort: 80
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

  # module.vault.kubernetes_manifest.vault_gateway will be created
+ resource "kubernetes_manifest" "vault_gateway" {
      + manifest = {
          + apiVersion = "networking.istio.io/v1beta1"
          + kind       = "VirtualService"
          + metadata   = {
              + name      = "vault-vs"
              + namespace = "vault"
            }
          + spec       = {
              + gateways = [
                  + "istio-system/istio-ingressgateway",
                ]
              + hosts    = [
                  + "vault.goboolean.io",
                ]
              + http     = [
                  + {
                      + route = [
                          + {
                              + destination = {
                                  + host = "vault-ui.vault.svc.cluster.local"
                                  + port = {
                                      + number = 80
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
      + object   = {
          + apiVersion = "networking.istio.io/v1beta1"
          + kind       = "VirtualService"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "vault-vs"
              + namespace                  = "vault"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + exportTo = (known after apply)
              + gateways = [
                  + "istio-system/istio-ingressgateway",
                ]
              + hosts    = [
                  + "vault.goboolean.io",
                ]
              + http     = [
                  + {
                      + corsPolicy       = {
                          + allowCredentials    = (known after apply)
                          + allowHeaders        = (known after apply)
                          + allowMethods        = (known after apply)
                          + allowOrigin         = (known after apply)
                          + allowOrigins        = (known after apply)
                          + exposeHeaders       = (known after apply)
                          + maxAge              = (known after apply)
                          + unmatchedPreflights = (known after apply)
                        }
                      + delegate         = {
                          + name      = (known after apply)
                          + namespace = (known after apply)
                        }
                      + directResponse   = {
                          + body   = {
                              + bytes  = (known after apply)
                              + string = (known after apply)
                            }
                          + status = (known after apply)
                        }
                      + fault            = {
                          + abort = {
                              + grpcStatus = (known after apply)
                              + http2Error = (known after apply)
                              + httpStatus = (known after apply)
                              + percentage = {
                                  + value = (known after apply)
                                }
                            }
                          + delay = {
                              + exponentialDelay = (known after apply)
                              + fixedDelay       = (known after apply)
                              + percent          = (known after apply)
                              + percentage       = {
                                  + value = (known after apply)
                                }
                            }
                        }
                      + headers          = {
                          + request  = {
                              + add    = (known after apply)
                              + remove = (known after apply)
                              + set    = (known after apply)
                            }
                          + response = {
                              + add    = (known after apply)
                              + remove = (known after apply)
                              + set    = (known after apply)
                            }
                        }
                      + match            = (known after apply)
                      + mirror           = {
                          + host   = (known after apply)
                          + port   = {
                              + number = (known after apply)
                            }
                          + subset = (known after apply)
                        }
                      + mirrorPercent    = (known after apply)
                      + mirrorPercentage = {
                          + value = (known after apply)
                        }
                      + mirror_percent   = (known after apply)
                      + mirrors          = (known after apply)
                      + name             = (known after apply)
                      + redirect         = {
                          + authority    = (known after apply)
                          + derivePort   = (known after apply)
                          + port         = (known after apply)
                          + redirectCode = (known after apply)
                          + scheme       = (known after apply)
                          + uri          = (known after apply)
                        }
                      + retries          = {
                          + attempts              = (known after apply)
                          + perTryTimeout         = (known after apply)
                          + retryOn               = (known after apply)
                          + retryRemoteLocalities = (known after apply)
                        }
                      + rewrite          = {
                          + authority       = (known after apply)
                          + uri             = (known after apply)
                          + uriRegexRewrite = {
                              + match   = (known after apply)
                              + rewrite = (known after apply)
                            }
                        }
                      + route            = [
                          + {
                              + destination = {
                                  + host   = "vault-ui.vault.svc.cluster.local"
                                  + port   = {
                                      + number = 80
                                    }
                                  + subset = (known after apply)
                                }
                              + headers     = {
                                  + request  = {
                                      + add    = (known after apply)
                                      + remove = (known after apply)
                                      + set    = (known after apply)
                                    }
                                  + response = {
                                      + add    = (known after apply)
                                      + remove = (known after apply)
                                      + set    = (known after apply)
                                    }
                                }
                              + weight      = (known after apply)
                            },
                        ]
                      + timeout          = (known after apply)
                    },
                ]
              + tcp      = (known after apply)
              + tls      = (known after apply)
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 1 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
